/*
✔︎ 미션 1.


1. 미션 제목
포인터를 이중으로 활용해보자

 

 

2. 지시문
유사 문제에서 배열을 포인터로 접근하는 방법을 학습하였습니다. 2차원 배열(5x5)을 선언한 후 포인터로 접근하여서 순서대로 출력하는 코드를 작성해보세요

Int arr[6][5] = {{1, 2, 3, 4, 5}, {6, 7, 8, 9, 10}, {11, 12, 13, 14, 15},
                       {16, 17, 18, 19, 20}, {21, 22, 23, 24, 25}, {26, 27, 28, 29, 30}};

배열의 값을 접근할 경우 arr[m][n] 또는 포인터로 접근할 수 있습니다. 2차 배열의 경우 이중 포인터로 접근할 수 있으니 활용해보시길 바랍니다. 이중 For문을 활용하시면 쉽게 접근할 수 있습니다.


예)
출력값:
26    27    28    29    30
21    22    23    24    25
…
6    7    8    9    10
1    2    3    4     5



3. 핵심 개념
#이중포인터 #루프
*/

#include <stdio.h>

int main (void)
{
    int arr[6][5] = 
    {
        {1, 2, 3, 4, 5}, 
        {6, 7, 8, 9, 10}, 
        {11, 12, 13, 14, 15},
        {16, 17, 18, 19, 20}, 
        {21, 22, 23, 24, 25}, 
        {26, 27, 28, 29, 30}
    };

    for(int i = 6; i >= 0; i--)
    {
        for(int j = 0; j < 5; j++)
        {
            printf("%2d ", *(*(arr+i)+j));
        }
        printf("\n");
    }    
    return 0;
}